<a href="https://colab.research.google.com/github/AmanCSE-1/Smart-Weather-Prediction-using-ML/blob/main/main.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<em><b>Objective :</b> A Financial organization wants to predict the possible defaulters for the consumer loans product. They have data about historic customer behavior based on what they have observed. Hence when they acquire new customers they want to predict who is riskier and who is not.</em>

# **Importing Libraries and Loading Dataset**

In [1]:
# Importing the fundamental libraries of data science

import pandas as pd                       # For Data Analysis and Preprocessing 
import numpy as np                        # For mathematical operations on data 
import matplotlib.pyplot as plt           # For Visualization and setting graph elements
import seaborn as sns                     # Consists of easy and interactive statistical graphics

In [2]:
df = pd.read_csv('/content/Dataset.csv')      # Reading the dataset

df.head()                                     # Printing the first 5 rows of the dataset

   Id   Income  Age  ...  CURRENT_JOB_YRS CURRENT_HOUSE_YRS Risk_Flag
0   1  1303834   23  ...                3                13         0
1   2  7574516   40  ...                9                13         0
2   3  3991815   66  ...                4                10         0
3   4  6256451   41  ...                2                12         1
4   5  5768871   47  ...                3                14         1

[5 rows x 13 columns]

In [3]:
df.shape                          # Returns the number of rows and number of columns of dataset

(252000, 13)

In [4]:
df.columns                        # Returns the name of columns of dataset

Index(['Id', 'Income', 'Age', 'Experience', 'Married/Single',
       'House_Ownership', 'Car_Ownership', 'Profession', 'CITY', 'STATE',
       'CURRENT_JOB_YRS', 'CURRENT_HOUSE_YRS', 'Risk_Flag'],
      dtype='object')

## **Exploratory Data Analysis**

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 252000 entries, 0 to 251999
Data columns (total 13 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   Id                 252000 non-null  int64
 1   Income             252000 non-null  int64
 2   Age                252000 non-null  int64
 3   Experience         252000 non-null  int64
 4   Married/Single     252000 non-null  object
 5   House_Ownership    252000 non-null  object
 6   Car_Ownership      252000 non-null  object
 7   Profession         252000 non-null  object
 8   CITY               252000 non-null  object
 9   STATE              252000 non-null  object
 10  CURRENT_JOB_YRS    252000 non-null  int64
 11  CURRENT_HOUSE_YRS  252000 non-null  int64
 12  Risk_Flag          252000 non-null  int64
dtypes: int64(7), object(6)
memory usage: 25.0+ MB

In [6]:
df.describe()

                  Id        Income  ...  CURRENT_HOUSE_YRS      Risk_Flag
count  252000.000000  2.520000e+05  ...      252000.000000  252000.000000
mean   126000.500000  4.997117e+06  ...          11.997794       0.123000
std     72746.278255  2.878311e+06  ...           1.399037       0.328438
min         1.000000  1.031000e+04  ...          10.000000       0.000000
25%     63000.750000  2.503015e+06  ...          11.000000       0.000000
50%    126000.500000  5.000694e+06  ...          12.000000       0.000000
75%    189000.250000  7.477502e+06  ...          13.000000       0.000000
max    252000.000000  9.999938e+06  ...          14.000000       1.000000

[8 rows x 7 columns]

In [ ]:
df.isna